/*
 * Default description for a new operation
 */
"operationDefaultDescription" = "New operation";
"accountDefaultName" = "New account";
"personDefaultName" = "New person";
"modeDefaultName" = "New mode";
"postDefaultName" = "New post";
"typeDefaultName" = "New type";
"typesSetDefaultName" = "New set";


/*
 * Alert texts
 */

/*
 * Document
 */
 
// Configuration needed
"configurationNeededAlertMessage" = "Configuration needed first.";
"configurationNeededAlertInfo" = "Before creating an operation, you must add at least an element in each category (account, mode and type).";
"configurationNeededAlertButtonGoto" = "Go to document's configuration";
"configurationNeededAlertButtonCancel" = "Cancel";

// Invalid action
"lastAvailableModeAlertMessage" = "Invalid action.";
"lastAvailableModeAlertInfo" = "An account must at least be associated with one mode.";
"lastAvailableModeAlertInfoButton" = "OK";

// Edition: Selected account does not provide the currently selected mode.
"editionAccountSelectedModeNotAvailableAlertMessage" = "Mode \"%@\" is no more available for account \"%@\".";
"editionAccountSelectedModeNotAvailableAlertInfo" = "The mode for this operation has been set to \"%@\" as replacement.";
"editionAccountSelectedModeNotAvailableAlertButton" = "OK";

// Edition: Setting transfer will remove the associated operation.
"AlertTextEditionTransferRemoveAssociatedOperationMessage" = "Corresponding operation will be deleted.";
"AlertTextEditionTransferRemoveAssociatedOperationInfo" = "Removing the transfer set for this transaction will delete the corresponding operation. Are you sure you want to continue?";
"AlertTextEditionTransferRemoveAssociatedOperationButtonConfirm" = "Continue";
"AlertTextEditionTransferRemoveAssociatedOperationButtonCancel" = "Cancel";

/*
 * Document properties
 */
 
// Deleting account confirmation
"deletingAccountConfirmationAlertMessage" = "Delete this account?";
"deletingAccountConfirmationAlertInfo" = "Are you sure you want to delete this account (%d operations will be deleted)?";
"deletingAccountConfirmationAlertButtonYes" = "Yes";
"deletingAccountConfirmationAlertButtonNo" = "No";

// Deleting person confirmation
"deletingPersonConfirmationAlertMessage" = "Delete this person?";
"deletingPersonConfirmationAlertInfo" = "Are you sure you want to delete this person (%d operations will be deleted)?";
"deletingPersonConfirmationAlertButtonYes" = "Yes";
"deletingPersonConfirmationAlertButtonNo" = "No";

// Deleting mode confirmation
"deletingModeConfirmationAlertMessage" = "Delete this mode?";
"deletingModeConfirmationAlertInfo" = "Are you sure you want to delete this mode (%d operations will be deleted)?";
"deletingModeConfirmationAlertButtonYes" = "Yes";
"deletingModeConfirmationAlertButtonNo" = "No";

// Deleting post confirmation
"deletingPostConfirmationAlertMessage" = "Delete this post?";
"deletingPostConfirmationAlertInfo" = "Are you sure you want to delete this post (%d types and %d operations will be deleted)?";
"deletingPostConfirmationAlertButtonYes" = "Yes";
"deletingPostConfirmationAlertButtonNo" = "No";

// Deleting type confirmation
"deletingTypeConfirmationAlertMessage" = "Delete this type?";
"deletingTypeConfirmationAlertInfo" = "Are you sure you want to delete this type (%d operations will be deleted)?";
"deletingTypeConfirmationAlertButtonYes" = "Yes";
"deletingTypeConfirmationAlertButtonNo" = "No";

// Removing value dates confirmation
"removingValueDatesConfirmationAlertMessage" = "Remove value dates of \"%@\" operations?";
"removingValueDatesConfirmationAlertInfo" = "If value dates are disabled, current values will be lost (for %d operations). Continue?";
"removingValueDatesConfirmationAlertButtonYes" = "Yes";
"removingValueDatesConfirmationAlertButtonNo" = "No";

// Making a mode unavailable for an account
"managingOperationsRemovingAvailableModeAlertMessage" = "Remove the mode \"%@\" from the account \"%@\"?";
"managingOperationsRemovingAvailableModeAlertInfo" = "%d operations in this account use this mode and thus will be deleted. Are you sure you want to do this?";
"managingOperationsRemovingAvailableModeAlertButtonYes" = "Yes";
"managingOperationsRemovingAvailableModeAlertButtonNo" = "No";


/*
 * Dynamic menus
 */
"hideDocumentToolbar" = "Hide toolbar";
"showDocumentToolbar" = "Show toolbar";

/*
 * Toolbar
 */
"toolbarLabelProperties" = "Properties";
"toolbarToolTipProperties" = "Edit the document's properties";
"toolbarLabelAdd" = "Add";
"toolbarToolTipAdd" = "Add an operation";
"toolbarLabelAddCreditOperation" = "Add (+)";
"toolbarToolTipAddPositive" = "Add credit operation";
"toolbarLabelAddDebitOperation" = "Add (-)";
"toolbarToolTipAddNegative" = "Add debit operation";
"toolbarLabelClone" = "Clone";
"toolbarToolTipClone" = "Clone selected operation(s)";
"toolbarLabelRemove" = "Remove";
"toolbarToolTipRemove" = "Remove selected operation";
"toolbarLabelSearchField" = "Search";
"toolbarToolTipSearchField" = "Search your document";
"toolbarLabelToggleFilterDrawer" = "Filter";
"toolbarToolTipToggleFilterDrawer" = "Toggle filter drawer";
"toolbarLabelDisplayModeSelection" = "Display mode";
"toolbarToolTipDisplayModeSelection" = "Select a display mode";
"displayModeSelectionPopUpEditionItemTitle" = "Edition";
"displayModeSelectionPopUpStatisticsItemTitle" = "Statistics";


/*
 * Statistics view strings
 */
 
// Column headers
"statisticsViewColumnHeaderAverage" = "avg.";


/*
 * Calendar
 */
 
 
/*
 * Misc
 */
"noSelectionPlaceHolderString" = "No Selection";

// FILTER
"FilterPeriodLabelText8"	= "All time";
"FilterPeriodLabelText7"	= "2 years";
"FilterPeriodLabelText6"	= "1 year";
"FilterPeriodLabelText5"	= "6 months";
"FilterPeriodLabelText4"	= "2 months";
"FilterPeriodLabelText3"	= "1 month";
"FilterPeriodLabelText2"	= "2 weeks";
"FilterPeriodLabelText1"	= "1 week";
"FilterPeriodLabelText0"	= "Today";